app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @feedback = Feedback.find(params[:id])

INSERT INTO "feedbacks" ("author", "created_at", "notes", "updated_at") VALUES (?, ?, ?, ?)  [["author", nil], ["created_at", Fri, 15 Mar 2013 03:03:14 UTC +00:00], ["notes", "MyText"], ["updated_at", Fri, 15 Mar 2013 03:03:14 UTC +00:00]]
---
  def create
    @feedback = Feedback.new(params[:feedback])

    @feedback.article = @article

    respond_to do |format|
      if @feedback.save

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @feedback = Feedback.find(params[:id])

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "feedbacks" WHERE "feedbacks"."id" = ?  [["id", 1]]
---
  def destroy
    @feedback = Feedback.find(params[:id])
    @feedback.destroy